app/controllers/api/v2/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ms@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "auth_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2019-12-12 07:14:00.292936"], ["auth_token", "zt-yAK4tdxUTMTEC-jPD"], ["id", 90]]
---
  def create
    user_password = params[:session][:password]
    user_email = params[:session][:email]
    user = User.find_by(email: user_email)
    if user && user&.valid_password?(user_password)
      user.update(latitude:params[:session][:latitude],longitude:params[:session][:longitude])