app/controllers/api/v1/categories_controller.rb

  def index
    categories = Category.all.page(params[:page]).per(params[:limit])
---
SELECT  "categories".* FROM "categories" LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "categories"