app/controllers/api/v1/contacts_controller.rb

  def index
    contacts = current_user.contacts.order_desc.page(params[:page]).per(params[:limit])
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."user_id" = $1 ORDER BY updated_at DESC LIMIT $2 OFFSET $3  [["user_id", 3], ["LIMIT", 25], ["OFFSET", 0]]