app/controllers/api/v1/products_controller.rb

SELECT  "products".* FROM "products" WHERE (name ilike '%%') LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products" WHERE (name ilike '%%')
---
  def index
    products = Product.where(nil)
    products = products.where("name ilike ?", "%#{params[:q]}%")
    products = products.page(params[:page]).per(params[:limit])