app/controllers/api/v1/sessions_controller.rb

  def create
    user_password = params[:session][:password]
    user_email = params[:session][:email]
    user = User.find_by(email: user_email)

    if user && user.valid_password?(user_password)
      sign_in user
      user.generate_authentication_token!
      user.save
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "prakash.vadher@agileinfoways.com"], ["LIMIT", 1]]
UPDATE "users" SET "current_sign_in_at" = $1, "current_sign_in_ip" = $2, "sign_in_count" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["current_sign_in_at", "2018-10-11 05:51:06.129419"], ["current_sign_in_ip", "127.0.0.1/32"], ["sign_in_count", 2], ["updated_at", "2018-10-11 05:51:06.131005"], ["id", 3]]