app/controllers/api/v1/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "account_type", "first_name", "last_name", "avatar_cloudinary_id", "auth_token") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"